In [1]:
import json

In [2]:
# load json file from /data folder
with open('monthlySalesbyCategoryMultiple.json') as json_data:
    d = json.load(json_data)

In [ ]:
d['contents'][0]

In [154]:
d

{'contents': [{'category': 'Furniture',
   'region': 'West',
   'monthlySales': [{'month': 20130101, 'sales': 38},
    {'month': 20130201, 'sales': 35},
    {'month': 20130301, 'sales': 41},
    {'month': 20130401, 'sales': 55},
    {'month': 20130501, 'sales': 58},
    {'month': 20130601, 'sales': 66},
    {'month': 20130701, 'sales': 74},
    {'month': 20130801, 'sales': 78},
    {'month': 20130901, 'sales': 38},
    {'month': 20131001, 'sales': 30},
    {'month': 20131101, 'sales': 26},
    {'month': 20131201, 'sales': 29}]},
  {'category': 'Technology',
   'region': 'West',
   'monthlySales': [{'month': 20130101, 'sales': 54},
    {'month': 20130201, 'sales': 66},
    {'month': 20130301, 'sales': 77},
    {'month': 20130401, 'sales': 70},
    {'month': 20130501, 'sales': 60},
    {'month': 20130601, 'sales': 63},
    {'month': 20130701, 'sales': 55},
    {'month': 20130801, 'sales': 47},
    {'month': 20130901, 'sales': 55},
    {'month': 20131001, 'sales': 30},
    {'month': 20131101, 'sales': 22},
    {'month': 20131201, 'sales': 77}]}]}

In [16]:
#intro pandas

In [18]:
import pandas as pd

In [23]:
my_df = pd.DataFrame([1,2,3,4])

In [24]:
my_df.empty

False

In [30]:
my_df.head()

   0
0  1
1  2
2  3
3  4

In [29]:
my_df.tail(1)

   0
3  4

In [33]:
my_df.columns

Index(['numeros'], dtype='object')

In [32]:
my_df.columns = ['numeros']

In [38]:
my_df.rename(columns={'numeros':'nombre_col'}, inplace=True)

In [39]:
my_df.head()

   nombre_col
0           1
1           2
2           3
3           4

In [41]:
my_df.index

RangeIndex(start=0, stop=4, step=1)

In [54]:
#datos por columna

In [48]:
my_df.nombre_col.values.tolist()

[1, 2, 3, 4]

In [53]:
my_df['nombre_col'].values.tolist()

[1, 2, 3, 4]

In [55]:
#filtrado

In [61]:
s = my_df['nombre_col'] >= 2

In [63]:
type(s)

pandas.core.series.Series

In [65]:
my_df[my_df['nombre_col'] >= 2]

   nombre_col
1           2
2           3
3           4

In [66]:
my_df.loc[my_df['nombre_col'] >= 2]

   nombre_col
1           2
2           3
3           4

In [68]:
my_df.iloc[1:5]

   nombre_col
1           2
2           3
3           4

In [70]:
my_df.to_pickle('mi_primer_df.p')

In [71]:
my_df.to_csv('mi_csv.csv')

In [87]:
df = pd.DataFrame([{'a':1,'b':2, 'c':3, 'nombre': 'juan'},
             {'a':6, 'b': 7, 'c': 0, 'nombre': 'andres'}])

In [95]:
df.set_index(['nombre'], inplace=True)

In [99]:
df.reset_index(inplace=True)

In [100]:
df

   nombre  a  b  c
0    juan  1  2  3
1  andres  6  7  0

In [111]:
df['resultado'] = (df.a + df.b) / df.c

In [114]:
df.a.sum()

7

In [109]:
df.replace(0, 0.001, inplace=True)

In [110]:
df

   nombre  a  b      c  resultado
0    juan  1  2  3.000   1.000000
1  andres  6  7  0.001        inf

In [116]:
df.describe()

              a         b         c     resultado
count  2.000000  2.000000  2.000000      2.000000
mean   3.500000  4.500000  1.500500   6500.500000
std    3.535534  3.535534  2.120613   9191.681049
min    1.000000  2.000000  0.001000      1.000000
25%    2.250000  3.250000  0.750750   3250.750000
50%    3.500000  4.500000  1.500500   6500.500000
75%    4.750000  5.750000  2.250250   9750.250000
max    6.000000  7.000000  3.000000  13000.000000

In [121]:
df = df.append(df*2)

In [124]:
df.replace('juan'*2, 'juan',inplace=True)

In [125]:
df.replace('andres'*2, 'andres',inplace=True)

In [129]:
df.reset_index(drop=True, inplace=True)

In [ ]:
help(df.reset_index)

In [132]:
#agregacion

In [135]:
df

   nombre   a   b      c  resultado
0    juan   1   2  3.000        1.0
1  andres   6   7  0.001    13000.0
2    juan   2   4  6.000        2.0
3  andres  12  14  0.002    26000.0

In [153]:
df.groupby('nombre').agg({'a': [sum, 'count'], 'b': lambda x: x.values.tolist()})

         a              b
       sum count <lambda>
nombre
andres  18     2  [7, 14]
juan     3     2   [2, 4]

In [157]:
df_1 = pd.DataFrame(d['contents'])

In [161]:
list_dict_0 = df_1.monthlySales.iloc[0]

In [162]:
list_dict_1 = df_1.monthlySales.iloc[1]

In [165]:
df_0_0 = pd.DataFrame(list_dict_0)

In [168]:
summary =df_0_0.describe()

In [171]:
summary.loc['50%'].sales

39.5

In [175]:
df_0_0.sort_values('sales', inplace=True)

In [177]:
df_0_0.shape

(12, 2)

In [179]:
df_0_0.reset_index(drop=True, inplace=True)

In [182]:
df_0_0.iloc[5:7]

      month  sales
5  20130901     38
6  20130301     41

In [188]:
df_0_0.sales.max()

78

In [205]:
df_0_0.sales.mean()

47.333333333333336

In [215]:
np.isclose(df_0_0.sales , df_0_0.sales.mean(), 0.2)

array([False, False, False, False,  True,  True,  True,  True, False,
       False, False, False])

In [227]:
df_0_0[np.isclose(df_0_0.sales , df_0_0.sales.mean(), rtol =0.15)]

      month  sales
6  20130301     41

In [191]:
import numpy as np

In [202]:
np.isclose(3.14, 3.141,0.0001 )

False

In [236]:
rng = pd.date_range('1/1/2011', periods=72, freq='H')

In [237]:
my_df.set_index(rng[:len(my_df)])

                     nombre_col
2011-01-01 00:00:00           1
2011-01-01 01:00:00           2
2011-01-01 02:00:00           3
2011-01-01 03:00:00           4